run/tutorials/DNS/dnsFoam/boxTurb16/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    patch0_half0
    {
        type            cyclic;
        nFaces          256;
        startFace       11520;
        matchTolerance  0.0001;
        neighbourPatch  patch0_half1;
    }
    patch0_half1
    {
        type            cyclic;
        nFaces          256;
        startFace       11776;
        matchTolerance  0.0001;
        neighbourPatch  patch0_half0;
    }
    patch1_half0
    {
        type            cyclic;
        nFaces          256;
        startFace       12032;
        matchTolerance  0.0001;
        neighbourPatch  patch1_half1;
    }
    patch1_half1
    {
        type            cyclic;
        nFaces          256;
        startFace       12288;
        matchTolerance  0.0001;
        neighbourPatch  patch1_half0;
    }
    patch2_half0
    {
        type            cyclic;
        nFaces          256;
        startFace       12544;
        matchTolerance  0.0001;
        neighbourPatch  patch2_half1;
    }
    patch2_half1
    {
        type            cyclic;
        nFaces          256;
        startFace       12800;
        matchTolerance  0.0001;
        neighbourPatch  patch2_half0;
    }
)

// ************************************************************************* //
